import { ScrollView, StyleSheet, Text, View } from 'react-native'
import React from 'react'
import { moderateScale, scale, textScale } from '../../utils/responsiveSizes';

const ArabicContent = () => {
    const Heading = ({ txt, customStyles }) => <Text style={[styles.heading, customStyles]}>{txt}</Text>;
    const Paragraph = ({ txt, customStyles }) => <Text style={[styles.paragraph, customStyles]}>{txt}</Text>;
    const BulletNumber = ({ txt, customStyles }) => {
        return (
            txt.map((e, i) => (
                <View key={i} style={[styles.flexRow, customStyles, { gap: 6 }]}>
                    <Text style={styles.bullet}>{`${++i})`}</Text>
                    <Text style={styles.bullet}>{e}</Text>
                </View>
            ))
        )
    }
    const BulletCircle = ({ txt, customStyles, txtStyles }) => {
        return (
            txt.map((e, i) => (
                <View key={i} style={[styles.flexRow, customStyles, { gap: 6 }]}>
                    <View style={[styles.bulletCrcle, {marginTop: 8}]} />
                    <Text style={[styles.bullet, txtStyles]}>{e}</Text>
                </View>
            ))
        )
    }

    return (
        <ScrollView contentContainerStyle={{ flexGrow: 1, paddingHorizontal: moderateScale(22) }} showsVerticalScrollIndicator={false}>
            <View style={styles.contentContainer}>
                <Heading txt="شروط وأحكام تطبيق Circle Care" />
                <Paragraph txt='شكرًا لزيارتكم لتطبيقنا. تنطبق شروط وأحكام Circle Care التالية بكاملها عندما تقوم بما يلي:' />
                <BulletNumber txt={[
                    '- فتح التطبيق أو استخدامه.',
                    '- التسجيل كعضو في التطبيق، مما يتيح لك الوصول إلى بعض أو جميع الأنشطة والمحتويات والمنتجات والخدمات والاستطلاعات والاختبارات (المتعارف عليها جميعاً كخدمات Circle Care)، بالإضافة إلى مختلف الميزات التفاعلية والخدمات (المتعارف عليها جميعاً بالخدمات التفاعلية بالاشتراك مع خدمات Circle Care).',
                    '- التسجيل في أحد مسابقاتنا أو عروضنا الترويجية التي نقدمها من وقت لآخر.'
                ]} />
                <Paragraph customStyles={{ marginTop: 8 }} txt='سياسة الخصوصية الخاصة بتطبيق Circle Care واتفاقية عدم الإفصاح وسرية المعلومات وقواعد التشغيل الأخرى لتطبيق Circle Care، والسياسات، وجداول الأسعار (إن وجدت)، وقواعد الترويج، والشروط والأحكام الإضافية أو الوثائق الأخرى مدرجة بالتفصيل هنا، لذا يرجى مراجعة الاتفاقية بعناية.' />
                <Paragraph txt='يجب أن توافق بشكل مؤكد على استخدام خدماتنا، وعن طريق القيام بذلك، توافق على هذه الشروط والأحكام، بما في ذلك سياسة الخصوصية. إذا لم توافق على الشروط والأحكام، بما في ذلك سياسة الخصوصية بكاملها، فلن تتمكن من الوصول إلى الخدمات أو الانتفاع بها بأي شكل من الأشكال.' />
                <Paragraph txt='إذا كنت ولي أمر أو وصي وقمت بالموافقة على استخدام طفلك للتطبيق، يجب أن توافق على الالتزام بشروط وأحكام هذا الاتفاق بخصوص استخدام طفلك للتطبيق.' />
                <Paragraph txt='يُقدم المحتوى الظاهر في التطبيق لأغراض معرفية فقط، كما يتم تفديم جزء كبير من المحتوى الظاهر في التطبيق، بما في ذلك محتوى الأعضاء (كما هو محدد أدناه)، من قبل جهات أو أطراف خارجية. لا تتحمل شركة Circle Care مسؤولية أو التزامًا بدقة أو فائدة أو توفر أي محتوى أو محتوى مٌقدم من عضو أو أي معلومات أخرى منقولة أو متاحة من خلال التطبيق و/أو الخدمات.' />
                <Paragraph txt='بموجب سياسة الخصوصية لدينا، سنقوم بمعالجة معلوماتك الشخصية (كما هو مذكور في سياسة الخصوصية) فقط وفقًا للقوانين المعمول بها في مجال حماية البيانات والخصوصية.' />

                <BulletCircle txtStyles={{ fontWeight: 'bold' }} txt={['نطاق الاتفاقية والتعديلات']} />
                <Paragraph txt='توافق على الشروط والأحكام المحددة في الاتفاقية بخصوص استخدامك للخدمات والمحتوى والتطبيق والترويجات ومحتوى الأعضاء و/أو أي تحاليل أخرى وأبحاث وآراء وتقارير و/أو معلومات أخرى يتم توفيرها من خلال نفس الاتفاقية. تعتبر هذه الاتفاقية هي الاتفاق الوحيد والكامل بينك وبين Circle Care بخصوص استخدامك لعروض Circle Care وتحل محل جميع الاتفاقيات السابقة أو المعاصرة والإقرارات والضمانات والتفاهمات التي تخص استخدامك لعروض Circle Care. يحق لـ Circle Care تحديث الاتفاقية ونطاق عروض Circle Care ووظائفها، بالكامل أو جزئيًا، دون إشعار؛ بشرط أن أي تعديل أو تغيير على أحكام التحكيم، أو أحكام منع الدعاوى الجماعية، أو أي أحكام أخرى ذات صلة بحل النزاعات لا ينطبق على أي نزاع نشأ قبل التعديل أو التعديل المعمول به. سيتم نشر أحدث اتفاقية على التطبيق، ويجب عليك مراجعة الاتفاقية قبل استخدام ما تقدمه Circle Care. من خلال استمرارك في استخدام عروض Circle Care، فإنك توافق على الامتثال والالتزام بجميع الشروط والأحكام الواردة في الاتفاقية سارية المفعول في ذلك الوقت (باستثناء النزاعات الناشئة قبل تعديل أو تغيير أحكام حل النزاعات والتي يجب أن تخضع لأحكام حل النزاعات المعمول بها في الوقت الذي ينشأ فيه النزاع المعني). لذلك، يجب عليك التحقق بانتظام من التطبيق للحصول على أي تحديثات و/أو تغييرات. أنت تدرك وتوافق على أن Circle Care ليست مسؤولة أو ملزمة بأي شكل من الأشكال عن عدم قدرتك على استخدام عروض Circle Care.' />

                <BulletCircle txtStyles={{ fontWeight: 'bold' }} txt={['لا نقدم علاج طبي أو نفسي']} />
                <Paragraph txt='لا يعتبر Circle Care مؤسسة علاجية ولا يقدم منتدىً علاجيًا ولا يشارك في تشخيص المرضى أو ممارسة الطب. المحتوى ومحتوى الأعضاء الذي يتم تقديمه من خلال التطبيق و/أو الخدمات لا يهدف بأي شكل من الأشكال إلى العلاج الطبي و/أو النفسي ولا يتم توفيره لغرض تشخيص أو علاج مشاكل أو حالات طبية و/أو نفسية، ولا يشكل بديلاً عن العلاج الطبي و/أو النفسي و/أو العلاج. التطبيق والخدمات ليست، ويجب ألا تكون، بديلاً عن نصيحة مقدم الرعاية الصحية أو المتخصص. استخدام التطبيق و/أو الخدمات لا ينشئ علاقة طبيب-مريض، وبناءً عليه، بينما تخضع التعاملات بينك وبين التطبيق لسياسة الخصوصية الخاصة بنا، إلا أنها غير محمية بقواعد السرية التي تكون في علاقة الطبيب بالمريض. يجب مناقشة ومراجعة المحتوى المتاح من خلال التطبيق ومحتوى الأعضاء و/أو الخدمات مع طبيبك البشري أو طبيبك النفسي أو معالجك أو مقدم الرعاية الصحية الخاص بك قبل اعتماد أي برنامج للعافية أو برنامج تمارين أو أي علاج آخر، سواء كان مقدمًا من خلال التطبيق أو الخدمات أو مكان آخر. استخدام التطبيق والخدمات والمحتوى الظاهر فيه ومحتوى الأعضاء يكون على مسؤوليتك الخاصة. لم يتم تقييم معلومات وبيانات بعض المنتجات و/أو الخدمات المعروضة من خلال التطبيق و/أو الخدمات من قبل إدارة الغذاء والدواء ولا تهدف أي من هذه المعلومات والخدمات إلى تشخيص أو علاج أو منع أي مرض أو اضطراب نفسي.' />

                <BulletCircle txtStyles={{ fontWeight: 'bold' }} txt={['المتطلبات']} />
                <Paragraph txt='عروض Circle Care غير متاحة لـ:' />
                <BulletCircle txt={[
                    'أي مستخدم تم إيقافه أو إزالة عضويته سابقًا من التطبيق أو الخدمات.',
                    'أي شخص دون سن السادسة عشرة ولم يأخذ موافقة ولي الأمر أو الوصي القانوني.'
                ]} />

                <BulletCircle txtStyles={{ fontWeight: 'bold' }} customStyles={{ marginTop: 12 }} txt={['التسجيل/الحساب/الرسوم/الفواتير']} />
                <Paragraph txt='في البداية، قد يُعرض على زوار التطبيق "تقييم" أو "موصى المتابعة" الخاص بتطبيق Circle Care. بعد الانتهاء، قد يقوم التطبيق بدعوة الزائر للتسجيل ليصبح عضوًا. كما يمكن للزائرين التسجيل للحصول على عضوية أو أن يصبحوا أعضاء من خلال حساباتهم على Facebook® أو البريد الإلكتروني، أو من خلال برنامج Circle Care HealthTM الذي تقدمه جهات مختلفة من مقدمي الرعاية الصحية والخطط الصحية و/أو أصحاب العمل، أو من خلال أي وسيلة أخرى يحددها Circle Care.' />
                <Paragraph txt='تحتفظ Circle Care بالحق، بمسؤوليتها الحصرية، في رفض العضوية، فضلاً عن رفض تقديم أي عرض من عروض Circle Care، لأي شخص ولأي سبب كان، بما يسمح به القانون المعمول به. يمكن أن تشمل بيانات التسجيل التي يجب عليك تزويدها على التطبيق للحصول على حق الوصول إلى عروض Circle Care كعضو: الاسم الكامل وعنوان البريد الإلكتروني وتاريخ الميلاد والعنوان السكني ورقم الهاتف اسم المستخدم وكلمة المرور. في حالة التسجيل عبر حسابك على Facebook®، ستضمن البيانات: هويتك على Facebook®، اسم ملفك الشخصي على Facebook®، صورة ملفك الشخصي على Facebook®، تاريخ تعليمك (كما هو مدرج في حسابك على Facebook)؛ اهتماماتك (كما هو مدرج في حسابك على Facebook®)؛ الصور المدرجة في حسابك على Facebook®؛ وأي معلومات أخرى تتاح لـ Circle Care من خلال حسابك على Facebook®، وبالتالي أنت توافق على تقديم بيانات تسجيل صحيحة ودقيقة وحالية وكاملة، كما توافق على تحديثها حسب الضرورة للحفاظ عليها بطريقة دقيقة ومحدثة. سيقوم Circle Care بالتحقق من جميع المسجلين والموافقة عليهم وفقًا للمعايير وإجراءات التحقق الخاصة به.' />
                <Paragraph txt='يمكنك الوصول إلى حسابك الخاص كعضو على التطبيق باستخدام اسم المستخدم وكلمة المرور الخاصين بك، أو عن طريق تسجيل الدخول عبر حسابك على Facebook® و/أو حساب البريد الإلكتروني، كما يُسمح ويُعتمد من قبل Circle Care، أو من خلال برنامج Circle Care Health. أنت مسؤول عن الحفاظ على سرية حسابك كعضو واسم المستخدم وكلمة المرور وعن تقييد الوصول إلى جهاز الكمبيوتر الخاص بك، وتوافق على تحمل مسؤولية جميع الأنشطة التي تحدث عبر استخدام حسابك كعضو واسم المستخدم وكلمة المرور.' />
                <Paragraph txt='إذا كان لديك سبب للاعتقاد بأن حسابك كعضو لم يعد آمنًا (على سبيل المثال، في حالة فقدان أو سرقة أو كشف أو استخدام غير مصرح به لاسم المستخدم أو كلمة المرور الخاصين بك، أو أي رقم بطاقة ائتمان، أو بطاقة اعتماد، أو بطاقة شحن مخزنة)، فعليك إخطار Circle Care بالمشكلة لتجنب المسؤولية المحتملة عن أي تهم غير مصرح بها على حسابك. للوصول واستخدام بعض خدماتنا، سيتعين عليك دفع الرسوم المعمول بها الموضحة على التطبيق لهذه الخدمات، بما في ذلك الضرائب المعمول بها ("رسوم الاشتراك")، ما لم تكن تستخدم وتوافق على الخدمات من خلال برنامج مُقدم من قبل شركة Circle Care Health Program، حيث ستتم تحديد شروط الدفع، إن وجدت، من قبل شركة Circle Care Health Program. عندما تشترك في الخدمات التي تتطلب دفعًا، فإنك توافق هنا على دفع رسوم الاشتراك وفقًا لشروط الفوترة سارية المفعول في الوقت الذي يُصبح فيه الرسم أو الرسوم قابلة للدفع، وتوافق على الالتزام بالشروط والأحكام مثل أي مستخدم آخر أو عضو. انظر القسم الخاص بسياسة الدفع أدناه.' />
                <Paragraph txt='نحتفظ بالحق في تغيير أو تعليق أو إنهاء أي حساب، بما في ذلك أي ميزة أو محتوى أو خدمة، في أي وقت ولأي سبب. قد نفرض أيضًا قيودًا على استخدام بعض الخدمات أو المحتوى أو الميزات و/أو نحد من وصولك إلى أجزاء من التطبيق أو الخدمات دون إشعار أو مسؤولية تقع علينا.' />
                <Paragraph txt='توافق Circle Care على إنهاء أي اشتراك مدفوع أو غير مدفوع في الخدمات بناءً على إشعار من العضو. يخضع حق العضو في استخدام التطبيق لأي قيود تضعهاCircle Care  أو جهة إصدار بطاقة الائتمان الخاصة بالعضو، ما لم يكن العضو يستخدم التطبيق من خلال شركة تابعة لبرنامج Circle Care Health، حيث قد يتم تطبيق شروط دفع أخرى. إذا تعذر تحصيل الدفعة من بطاقة الائتمان الخاصة بالعضو أو تمت إرجاع الدفعة لأي سبب، بما في ذلك رد المبلغ إلى البطاقة، تحتفظ Circle Care بالحق في تعليق أو إنهاء وصول العضو لحسابه، وبالتالي إنهاء هذه الاتفاقية وجميع التزامات شركة سيركل كير بموجبها.' />
                <Paragraph txt='قد يرفض Circle Care طلبك و/أو يقوم بإنهاء عضويتك في أي وقت ولأي سبب، بناءً على تقديرنا فقط. قد تشمل هذه الأسباب، دون حصر: عندما يعتقد Circle Care أنك تنتهك الاتفاقية بأي شكل من الأشكال؛ وعندما يعتقد Circle Care أنك، في أي وقت، تقوم بأي نشاط تجاري غير مصرح به من خلال الخدمات.' />
                <Paragraph txt='لأغراض هذه الاتفاقية، يُقصد بـ "Facebook®" شركة Facebook, Inc، وهي علامة تجارية مسجلة لشركة Facebook, Inc. نحيطكم علما بأن  Circle Careليست مرتبطة بأي شكل من الأشكال بـ Facebook®، كما أن عروض Circle Care لا تحظى بموافقة أو رعاية من Facebook®.' />

                <BulletCircle txtStyles={{ fontWeight: 'bold' }} txt={['Circle Care']} />
                <Paragraph txt='تقدم Circle Care تطبيقها وخدماتها لمختلف مقدمي الرعاية الصحية والخطط الصحية و/أو المنظمات والشركات الأخرى. قد يخضع الأعضاء والموظفين والعملاء والزبائن لشركات برنامج Circle Care Health لشروط الدفع المقدمة من شركة برنامج Circle Care Health الخاصة بهم.' />
                <Paragraph txt='من خلال المشاركة في برنامج التدريب، أنت توافق على الكشف عن هذه المعلومات لأي مدرب تعمل معه. يتحمل المدرب مسؤولية الحفاظ على سرية هذه المعلومات وأي معلومات شخصية أخرى تشاركها معه، ولا يحق للمدرب أن يكشف هذه المعلومات لأي شخص آخر إلا في حالة وجود متطلب قانوني لذلك.' />

                {/* Payment Policy */}
                <BulletCircle txtStyles={{ fontWeight: 'bold' }} txt={['سياسة الدفع']} />
                <Paragraph txt='يُمكن الوصول إلى بعض أقسام تطبيق Circle Care أو بعض برامج Circle Care مجانًا، ولكننا نفرض رسومًا على بعض منتجاتنا وخدماتنا بناءً على الاشتراك. تنطبق سياسة الدفع هذه على المستخدمين الذين قاموا بشراء خطة اشتراك في Circle Care للوصول إلى Circle Care من خلال تطبيق الهواتف المحمولة.' />

                <BulletCircle txtStyles={{ fontWeight: 'bold' }} txt={['نظرة عامة على خطط الاشتراك والمدفوعات']} />
                <Paragraph txt='نقدم عدة أنواع من خطط الاشتراك الفردية والهدايا. يمكن أن تختلف شروط التسعير الخاصة بحسابك اعتمادًا على العروض الترويجية ونوع الاشتراك والمدة التي تختارها في وقت الشراء. يتم تجديد معظم خطط الاشتراك لدينا تلقائيًا، كما هو موضح بالتفصيل أدناه. إذا كانت لديك أسئلة حول خطتك بعد التسجيل، يرجى الرجوع إلى صفحة العضوية الخاصة بك والبريد الإلكتروني التأكيدي الذي سيتم إرساله إليك بعد عملية الشراء.' />
                <Paragraph txt='قد نقدم في بعض الأحيان، بتقديرنا، فترة تجريبية لمدة 30 يومًا لخطط الاشتراك السنوية والثنائية السنوية. إذا قمت بالتسجيل في هذا العرض، فلن يتم محاسبتك للفترة الكاملة حتى نهاية فترة التجربة لمدة 30 يومًا. بعد انتهاء أي فترة تجريبية، يتم محاسبة خطط الاشتراك لدينا في دفعة واحدة مقدمًا لمدة كاملة من الخطة التي تختارها. بالتالي، إذا قمت بشراء خطة شهرية، سيتم محاسبتك عن الدفعة الكاملة للشهر في بداية كل شهر، وإذا قمت بشراء خطة سنوية أو ثنائية السنوات، سيتم محاسبتك عن السنة الكاملة أو الفترة السنوية في بداية الفترة. ستكون أيضًا قادرًا على إلغاء الاشتراك السنوي أو الثنائي السنوي خلال 30 يومًا بعد خصم الرسوم من حسابك، وهذا وفقًا لشروط إلغاء الاشتراك لدينا. قد نستخدم معالج مدفوعات تابعًا لجهة خارجية لتسهيل مدفوعاتك.' />

                <BulletCircle txtStyles={{ fontWeight: 'bold' }} txt={['خطط اشتراك مدى الحياة']} />
                <Paragraph txt='تقدم Circle Care خطة اشتراك مدى الحياة. تتيح لك خطة اشتراك مدى الحياة من Circle Care الوصول إلى خدمات Circle Care المتوفرة في وقت شرائك طالما ظلت هذه الخدمات متاحة. لا يجوز لك تخصيص خطة اشتراك مدى الحياة لأي شخص آخر. لا تقدم Circle Care أي ضمانات أو إقرارات بأن أيًا من خدماتها ستظل متوفرة لأي فترة زمنية، وبشرائك لخطة مدى الحياة، فإنك تقر وتوافق على أن خدمات Circle Care قد تتغير أو تتوقف في أي وقت في المستقبل.' />

                <BulletCircle txtStyles={{ fontWeight: 'bold' }} txt={['سياسة الاسترداد']} />
                <Paragraph txt='تقدم Circle Care ضمان استرداد الأموال لمدة 30 يومًا بنسبة 100٪ للاشتراكات في الخطط السنوية والسنوية والمدى الحياة. يُستثنى الاشتراك الشهري من هذا العرض. يمكنك استرداد المبلغ عن طريق الاتصال بفريق خدمة العملاء لدينا خلال 30 يومًا من عملية الشراء. لن تكون الطلبات المقدمة بعد 30 يومًا مؤهلة. لا نقوم باسترداد الأموال بشكل نسبي أو نقدم استردادًا جزئيًا إلا في الحالات التي نقوم فيها بإنهاء عضويتك لأي سبب آخر غير مخالفتك لشروطنا. عمليات شراء الاشتراكات التي تتم من خلال متجر Apple iTunes أو تطبيقات iPhone أو iPad الخاصة بنا نهائية ولا يمكن استرداد قيمتها. تخضع عمليات الشراء هذه لشروط دفع Apple وسياسة الدفع الخاصة بها، وقد تستبعد سياسة Apple عمليات الاسترداد أيضًا.' />
                <Paragraph txt='المشتريات التي تمت من خلال متجر Google Play أو تطبيقات Android الخاصة بنا غير قابلة للاسترداد. تخضع هذه المشتريات لشروط وسياسة الدفع لـ Google Play، وقد تستبعد سياسة Google Play الاستردادات أيضًا.' />

                <BulletCircle txtStyles={{ fontWeight: 'bold' }} txt={['التجديد']} />
                <Paragraph txt='تتجدد جميع الاشتراكات في Circle Care التي تمت على التطبيق تلقائيًا، ما عدا عمليات الشراء كهدايا، باستخدام تفاصيل الدفع الموجودة في حسابك. إذا قمت بشراء اشتراك مع ميزة التجديد التلقائي، فإنك توافق على أننا مخولون باستخدام معلومات الدفع الموجودة لدينا لفرض رسوم التجديد.' />

                <Paragraph txt='يتم عرض تاريخ التجديد التلقائي لاشتراكك على صفحة عضويتك وفي رسالة التأكيد عن الدفع المرسلة بعد عملية الشراء الأولية. يمكنك إلغاء ميزة التجديد التلقائي في أي وقت قبل تاريخ التجديد عن طريق اتباع التعليمات على صفحة عضويتك أو عن طريق الاتصال بفريق خدمة العملاء لدينا. بالإضافة إلى ذلك، للاشتراكات السنوية والثنائية السنوية، سنقوم بإعادة مبالغ التجديد بالكامل إذا اتصلت بفريق خدمة العملاء لدينا خلال 7 أيام بعد إجراء الدفعة التجديدية. لا نقدم استردادات للدفعات التجديدية للاشتراكات الشهرية بعد أن تمت خصم رسوم الاشتراك الشهري من حسابك.' />

                <Paragraph txt='ذا اشتركت في خدماتنا باستخدام خصم ترويجي، فقد تكون رسوم تجديد اشتراكك أعلى من سعر الاشتراك الأولي. يرجى الرجوع إلى صفحة عضويتك أو البريد الإلكتروني الذي تم إرساله بعد عملية الشراء الأولية للحصول على تفاصيل حول مبلغ التجديد وتاريخ التجديد التالي.' />
                
                <BulletCircle txtStyles={{ fontWeight: 'bold' }} txt={['زيادة الأسعار']} />
                <Paragraph txt='قد تتغير أسعارنا في المستقبل. سنقوم بإعلامك في وقت أي تغيير في الأسعلر وإعطاءك فرصة لتغيير أو إلغاء اشتراكك قبل تطبيق تلك التغييرات على حسابك أو تغيير تفاصيل الدفع الخاصة بك فيما يتعلق بالتجديد التلقائي.' />

                <BulletCircle txtStyles={{ fontWeight: 'bold' }} txt={['معلومات الدفع']} />
                <Paragraph txt='بتقديم معلومات الدفع إلينا، فإنك تقر بأن معلومات الدفع دقيقة وحديثة وباسمك أو باسم فرد قام بتفويضك باستخدام معلومات دفعه لشراء اشتراكك.' />
                <Paragraph txt='إذا قدمت معلومات دفع شخص آخر، فإنك توافق على أن نقوم برد المبلغ إلى ذلك الشخص إذا طلب ذلك وإذا كان الحساب مؤهلاً لاسترداد الأموال وفقًا لسياسة الدفع الخاصة بنا. قد يؤدي هذا إلى انقطاع خدمات Circle Care الخاصة بك أو إنهاءها.' />

                <BulletCircle txtStyles={{ fontWeight: 'bold' }} txt={['وصف المحتوى']} />
                <Paragraph txt='بموجب شروط وأحكام الاتفاقية، سيكون لدى المستخدمين النهائيين الذين يمتلكون التكنولوجيا اللازمة ويقومون بالتسجيل كأعضاء الفرصة لعرض جميع أو بعض الاختبارات والتحديات والأنشطة، بالإضافة إلى الوسائط والنصوص والصور والرسومات والتحليلات والأبحاث والتعليقات والآراء والنصائح والبيانات والعروض والخدمات والطلبات والاستدعاءات وواجهات المستخدم والصوتيات والفيديوهات والصور والعلامات التجارية والشعارات والأعمال الفنية والمقالات الإخبارية والمحتوى الآخر المتاح من خلال التطبيق و/أو الخدمات. يتم تجميع المحتوى وتوزيعه وعرضه من قبل Circle Care، بالإضافة إلى الأعضاء ومقدمي المحتوى من الجهات الخارجية. لا يتحكم Circle Care في المحتوى الذي يقدمه الأعضاء و/أو الجهات الخارجية والذي يتاح من خلال الخدمات و/أو التطبيق. يتحمل الأعضاء و/أو الجهات الخارجية المسؤولية عن دقة واكتمال وملاءمة و/أو فائدة هذا المحتوى. يجب عدم الاعتماد بشكل ضروري على المحتوى. لا يمثل Circle Care ولا يضمن أن المحتوى والمعلومات الأخرى التي يتم نشرها من خلال الخدمات و/أو التطبيق دقيقة وكاملة ومحدثة أو مناسبة. أنت تفهم وتوافق على أن Circle Care لن تكون مسؤولة عن هذا المحتوى ولا تتعهد Circle Care بمراقبته. أنت توافق على أن Circle Care ليست لديها أي التزام لك ولا تتحمل أي مسؤولية فيما يتعلق بأي محتوى من هذا القبيل. قد تجد أن بعض المحتوى الذي يتم نشره من قبل الأعضاء و/أو الجهات الخارجية يكون قديمًا أو ضارًا أو غير دقيق أو مضلل. يرجى توخي الحذر واستخدام العقل وترجيح السلامة عند استخدام عروض Circle Care.' />
                <Paragraph txt='إذا كنت ترغب في تقديم شكوى، أو إبلاغ Circle Care عن نزاع، أو إبلاغ Circle Care عن أي استخدام غير لائق لمحتواك أو معلوماتك الأخرى، أو إبلاغ Circle Care عن محتوى غير دقيق أو مضلل يظهر في التطبيق أو متاح بأي طريقة من طرق الخدمات، يرجى الاتصال بنا.' />
                
                <BulletCircle txtStyles={{ fontWeight: 'bold' }} txt={['وصف خدمات Circle Care']} />
                <Paragraph txt='بموجب شروط وأحكام الاتفاقية، بما في ذلك، على سبيل المثال لا الحصر، يحق للأعضاء الوصول إلى خدمات Circle Care، والتي تشمل سلسلة من أنشطة وتحديات Circle Care الخاصة بالإضافة إلى محتوى آخر مصمم لتمكين الأعضاء من زيادة مستوى سعادتهم باستخدام مجموعة واسعة من المهارات. بعد أن يكمل العضو أنشطة معينة، أو يحقق درجة معينة فيما يتعلق بها، يجوز له/لها:' />
                <Paragraph txt='- كتابة وصف موجز لتجربتهم، وإرفاق صورة توضح جانبًا ذا صلة من النشاط المعمول به، وبناءً على طلب العضو، نشر مشاركة النشاط على التطبيق وجعلها قابلة للعرض سواء لمجموعة محددة من الأعضاء، أو جميع الأعضاء.' />
                <Paragraph txt='- نشر مشاركتهم في النشاط والمعلومات ذات الصلة من خلال حساب Facebook® الخاص بهم (والتي ستكون قابلة للعرض على Facebook® للأشخاص المسموح لهم بذلك بواسطة إعدادات حساب العضو على Facebook®).' />
                <Paragraph txt='- الوصول إلى أنشطة أكثر تقدمًا تتطلب إكمال أنشطة أولية معينة للوصول إليها.' />
                <Paragraph txt='يرجى الملاحظة أنه كما هو معلن فيما يتعلق بأنشطة "المجموعة"، حيث يشارك عضو في نشاط جماعي، يجوز نشر مشاركة هذا العضو على تطبيق Circle Care، ليكون قابلاً للعرض من قبل جميع الأعضاء. يُمنع الأعضاء من نشر روابط مواقع الويب والأزرار والإعلانات المصورة ومسارات التسجيل المشترك ونسخ أو عمليات إنشاء إجراءات في أي منشورات الأنشطة و/أو الإعلان عن منتجات و/أو خدمات خارجية ضمن خدمات Circle Care. تحتفظ Circle Care بالحق في حظر أي سلوك من قبل الأعضاء أو إزالة أي منشور نشاط من خدمات Circle Care و/أو التطبيق في أي وقت ولأي سبب، وفقًا لتقدير Circle Care وحدها. قد تشمل أسباب الإزالة الحالات التي تعتقد فيها Circle Care أن منشور النشاط غير مناسب لخدمات Circle Care و/أو التطبيق لأي سبب، بما في ذلك على سبيل المثال لا الحصر:' />
                <Paragraph txt='- . أن ينتهك منشور النشاط القسمين 10 و/أو 11 أدناه؛ و/أو' />
                <Paragraph txt='ب. حيث تعتقد Circle Care أن منشور النشاط، أو العضو المعني، ينتهك الاتفاقية بطريقة أخرى.' />
                <Paragraph txt='أنت تدرك وتوافق على أن Circle Care لن تكون مسؤولة تجاهك أو تجاه أي مستخدمين نهائيين أو أي طرف خارجي عن أي مطالبة تتعلق باستخدامك أو عدم قدرتك على استخدام خدمات Circle Care.' />

                <Paragraph txt='2. وصف الخدمات التفاعلية' />
                <Paragraph txt='بموجب شروط وأحكام الاتفاقية، بما في ذلك، على سبيل المثال لا الحصر، تلك الموجودة في الأقسام 11 و 12 أدناه، يحق للأعضاء الوصول إلى الخدمات التفاعلية. تتيح الخدمات التفاعلية للأعضاء التواصل مع الأعضاء الآخرين عبر أقسام التعليقات والمناطق التفاعلية الأخرى في التطبيق، بالإضافة إلى التطبيقات والميزات الأخرى التي قد تتاح من قبل Circle Care على منصات التواصل الاجتماعي الخارجية مثل Facebook® من وقت لآخر. فيما يتعلق بالخدمات التفاعلية، يكون كل عضو مسؤولًا بشكل كامل عن التعليقات والآراء والبيانات والعروض والاقتراحات والتغذية الراجعة والمحتوى الآخر المنشور من خلال الخدمات التفاعلية. يُمنع منعًا باتًا من الأعضاء نشر روابط في أي تعليقات و/أو الإعلان عن منتجات و/أو خدمات الطرف الثالث ضمن الخدمات التفاعلية. تحتفظ Circle Care بالحق في منع أي سلوك من قبل الأعضاء أو إزالة أي تعليقات من الخدمات التفاعلية و/أو التطبيق في أي وقت ولأي سبب، بمسؤوليتها الحصرية. قد تشمل أسباب الإزالة أن يعتقد Circle Care أن التعليقات المنشورة من قبل عضو ما غير مناسبة للخدمات التفاعلية و/أو التطبيق لأي سبب، بما في ذلك، على سبيل المثال لا الحصر:' />
                <Paragraph txt=' أ. أن تتعارض التعليقات مع الأجزاء 11 و/أو 12 أدناه؛ و/أو' />
                <Paragraph txt='ب. حيث تعتقد Circle Care أن التعليقات، أو العضو المعني، ينتهك الاتفاقية بطريقة أخرى.' />
                <Paragraph txt='أنت تدرك وتوافق على أن Circle Care لن تكون مسؤولة تجاهك أو تجاه أي مستخدمين نهائيين أو أي طرف خارجي عن أي مطالبة تتعلق باستخدامك أو عدم قدرتك على استخدام الخدمات التفاعلية.' />
                
                <BulletCircle txtStyles={{ fontWeight: 'bold' }} txt={['تفاعلات الأعضاء/ التعليقات/ منشورات الأنشطة']} />
                <Paragraph txt='في إطار استخدامك لـ Circle Care وخدماتها، يجوز لك تحميل محتوى العضو ونشره وتوزيعه ونشره وإرساله إلينا، بما في ذلك على سبيل المثال لا الحصر، الصور والصور التي قمت بالتقاط والتعليقات والتعليقات، والتي يجوز لنا وفقًا لتقديرنا نشرها على Circle Care. تمنح بموجب هذه الوثيقة شركة Circle Care حقًا (بما في ذلك أي حقوق معنوية) ورخصة غير قابلة للإلغاء وغير حصرية وقابلة للتحويل وخالية من حقوق الملكية على مستوى العالم (بما في ذلك أي حقوق معنوية) لاستخدام محتوى العضو على Circle Care وللترويج والإعلان عن Circle Care بأي طريقة. فيما يتعلق بتشغيل Circle Care وخدماتها والترويج لها، فإنك توافق على أن شركة Circle Care لها الحق في نسخ المحتوى الخاص بالعضو وتخزينه مؤقتًا وتعديله ونشره وعرضه وتوزيعه وترجمته وإنشاء أعمال مشتقة منه وتخزينه، بغض النظر عن الوسط أو التكنولوجيا أو الشكل الذي يتم استخدامه فيه. على سبيل المثال، يجوز لشركة Circle Care استخدام محتوى العضو للترويج لـ Circle Care والخدمات كجزء من كتاب أو خيار عرض أو عرض توضيحي أو كتيب.' />
                <Paragraph txt='كما تقر بأنك، في حال عدم امتلاكك أي من هذه الحقوق، فإن صاحب هذه الحقوق قد تنازل بشكل كامل وفعال عن جميع هذه الحقوق مع منحك بشكل صحيح وقابل للإلغاء حق منح الترخيص المذكور أعلاه. أنت تدرك وتوافق على أنك وحدك المسؤول عن شكل محتوى العضو ومضمونه ودقته. أنت مسؤول عن منشوراتك الخاصة وعواقب منشوراتك. أنت وحدك المسؤول عن تفاعلاتك مع مستخدمي التطبيق الآخرين، بما في ذلك، على سبيل المثال لا الحصر، الأعضاء ومقدمي الخدمة من الجهات الخارجية. نظرًا لأننا لا نشارك في تفاعلات التطبيق مع المستخدمين، في حالة حدوث خلاف مع واحد أو أكثر من مستخدمي التطبيق والأعضاء و/أو موفري الخدمات من جهات خارجية، فإنك بموجب هذه الوثيقة تبرئ Circle Care بما في ذلك، على سبيل المثال لا الحصر، مسؤوليها ومديريها وأعضائها والمساهمين فيها ووكلائها والشركات التابعة لها والموظفين، من أية أو كافة المطالبات والمطالب والأضرار (الفعلية والتبعية) من كل نوع وطبيعة، معروفة وغير معروفة، مشتبه فيها وغير متوقعة، معلنة وغير معلنة، تنشأ من، أو بأي شكل من الأشكال مرتبطة بهذه النزاعات. تحتفظ Circle Care بالحق، ولكنها غير ملزمة، بمراقبة النزاعات بينك وبين مستخدمي التطبيق الآخرين والأعضاء و/أو مقدمي الخدمة من جهات خارجية. تتضمن الخدمات التعليقات ومنشورات الأنشطة التي يتم توفيرها مباشرة من قبل الأعضاء. هؤلاء الأعضاء وحدهم مسؤولون عن دقة واكتمال وملاءمة و/أو فائدة محتوى هذا العضو.' />
                <Paragraph txt='لا تقر شركة Circle Care أو تضمن أن محتوى العضو المنشور من خلال تطبيق Circle Care دقيق أو كامل أو مناسب. قد تجد محتوى معين لأعضاء مسيئًا أو ضارًا أو غير دقيق و/أو مخادعًا. يرجى توخي الحذر والحس السليم والسلامة عند استخدام الخدمات و/أو التطبيق. أنت تدرك وتوافق على أن شركة Circle Care لن تكون مسؤولة تجاهك، أو أي مستخدمين نهائيين، أو أي طرف خارجي، عن أي مطالبة تتعلق بأي محتوى عضو.' />
                <Paragraph txt='لا تقبل شركة Circle Care الأفكار أو الأعمال أو المواد الأخرى غير المرغوب فيها، وتقر بأنك مسؤول وتتحمل جميع المخاطر فيما يتعلق باستخدام أو توزيع أي من هذه الأفكار أو الأعمال أو المواد.' />

                <BulletCircle txtStyles={{ fontWeight: 'bold' }} txt={['شروط استخدام ومحددات محتوى الأعضاء']} />
                <Paragraph txt='كعضو، أنت توافق على أنك مسؤول وحدك عن محتوى العضو و/أو أي معلومات أخرى تقوم بنشرها أو نقلها أو نشرها على Circle Care و/أو الخدمات ومن خلالها. أنت توافق على استخدام التطبيق لـ Circle Care و/أو الخدمات بطريقة تتوافق مع أي وجميع القوانين واللوائح والأنظمة المعمول بها. فيما يتعلق باستخدامك لـ Circle Care و/أو الخدمات، توافق على عدم:' />
                <BulletCircle txt={[
                    'عرض أي أرقام هواتف أو عناوين شوارع أو عناوين URL أو عناوين بريد إلكتروني أو معلومات سرية لأي طرف ثالث.', 'عرض أي ملفات صوتية أو نصوص أو صور أو مقاطع فيديو أو صور أخرى تحتوي على معلومات سرية.', 'عرض أي ملفات صوتية أو نصوص أو صور أو مقاطع فيديو أو صور أخرى قد تعتبر غير لائقة أو فاحشة في مجتمعك، كما هو محدد بموجب القانون المعمول به.',
                    'انتحال شخصية أي شخص أو كيان.', 
                    'مطاردة أو مضايقة أي شخص بأي طريقة أخرى.', 
                    'المشاركة في أي إعلانات غير مصرح بها أو استقطاب تجاري لطرف ثالث في التطبيق.', 
                    'إرسال أي رسائل متسلسلة أو بريد عشوائي أو بريد إلكتروني غير مرغوب فيه.', 
                    'التعبير أو الإيحاء بأن أي بيانات تقدمها معتمدة من قبل  Circle Care™ دون الحصول على موافقة كتابية مسبقة محددة منا.', 
                    'جمع المعلومات الشخصية للأعضاء الآخرين أو الأشخاص الآخرين، سواء لأغراض تجارية أم لا، دون موافقتهم الصريحة.', 
                    'استخدام أي برامج روبوت أو عنكبوت أو تطبيق بحث أو تطبيقات استرجاع أو أي جهاز أو عملية يدوية أو آلية أخرى لاسترداد أو فهرسة أو استخراج البيانات أو إعادة إنتاج أو عرض Circle Care أو محتواه بأي طريقة.', 
                    'نشر أو توزيع أو إعادة إنتاج بأي طريقة أي مواد محمية بحقوق النشر أو علامات تجارية أو علامات خدمة أو أسرار تجارية أو براءات اختراع أو أسماء نطاقات أو معلومات ملكية أخرى دون الحصول على موافقة مسبقة من مالك حقوق الملكية هذه.', 
                    'إزالة أي إشعارات بحقوق الطبع والنشر، أو العلامات التجارية، أو أي حقوق مملوكة أخرى الموجودة على Circle Care.', 
                    'التدخل في أو تعطيل أي من الخدمات، أو التطبيقات، و/أو الخوادم أو الشبكات المتصلة بها.', 
                    'نشر، أو عرض للتنزيل، أو إرسال بالبريد الإلكتروني، أو نقل أي مواد تحتوي على فيروسات الكمبيوتر، أو أي رموز الكمبيوتر، أو ملفات، أو برامج مصممة للتدخل، أو تدمير، أو تقييد وظائف أي برامج الكمبيوتر، أو أجهزة الكمبيوتر، أو معدات الاتصالات.', 
                    'نشر، أو عرض للتنزيل، أو نقل، أو الترويج لأو إتاحة أي برامج، أو منتجات، أو خدمات غير قانونية أو تنتهك حقوق طرف ثالث، بما في ذلك، على سبيل المثال لا الحصر، برامج التجسس، أو الإعلانات الآلية، أو البرامج المصممة لإرسال إعلانات غير مرغوب فيها (أي "برامج البريد المزعج")، أو الخدمات التي ترسل إعلانات غير مرغوب فيها، أو البرامج المصممة لبدء هجمات "منع الخدمة"، أو برامج قنابل البريد، والبرامج المصممة للحصول على وصول غير مصرح به إلى الشبكات على الإنترنت.', 
                    '"تأطير" أو "عكس" أي جزء من Circle Care، دون إذننا الكتابي المسبق.', 
                    'استخدام العلامات الوصفية أو الرموز أو الأجهزة الأخرى التي تحتوي على أي إشارة إلى Circle Care، أو الخدمات، و/أو Circle Care بهدف توجيه أي شخص إلى أي تطبيق آخر لأي غرض؛ و/أو', 
                    'تعديل، أو تكييف، أو الترخيص للأطراف الثالثة، أو ترجمة، أو بيع، أو عكس هندسة البرمجيات المستخدمة على الخدمات و/أو التطبيق أو أي جزء منها، أو فك تشفيرها، أو تفكيكها بأي شكل من الأشكال.']} 
                    />
                <Paragraph txt='الانخراط في أي من الممارسات المحظورة المذكورة أعلاه يعتبر خرقًا لاتفاقية الاستخدام. ونتيجة لذلك، قد يقوم Circle Care بإنهاء عضويتك على الفور دون إشعار مسبق بدون تقديم أي تبرير وذلك وفقًا لتقديرنا الخاص. بالإضافة إلى ذلك، يحتفظ Circle Care بالحق في متابعة جميع السبل القانونية المتاحة ضد الأعضاء الذين يقومون بمثل هذا السلوك المحظور.' />

                <BulletCircle txtStyles={{ fontWeight: 'bold' }} txt={['المتطلبات']} />
                <Paragraph txt='بصفتك عضوًا، يتم منحك ترخيصًا غير حصري وغير قابل للتحويل وقابل للإلغاء ومحدودًا للوصول إلى عروض Circle Care واستخدامها ومحتوى عضو طرف ثالث معين وفقًا للاتفاقية. يجوز لشركة Circle Care إنهاء هذا الترخيص في أي وقت ولأي سبب من الأسباب. ما لم تُصرّح شركة Circle Care صراحة بذلك ، يمكنك فقط استخدام عروض Circle Care ومحتوى أعضاء من جهات خارجية لاستخدامك الشخصي. لا يجوز إعادة إنتاج أي جزء من عروض Circle Care أو محتوى عضو تابع لجهة خارجية بأي شكل من الأشكال أو دمجه في أي نظام لاسترجاع المعلومات ، إلكترونيًا أو ميكانيكيًا. لا يجوز لك استخدام أو نسخ أو محاكاة أو استنساخ أو تأجير أو بيع أو تعديل أو فك ترجمة أو تفكيك أو عكس هندسة أو نقل عروض Circle Care أو محتوى الأعضاء من جهات خارجية و/أو أي جزء منها. لا يجوز لك إنشاء أي "أعمال مشتقة" عن طريق تغيير أي جانب من جوانب عروض Circle Care و/أو محتوى أعضاء من جهات خارجية. لا يجوز لك استخدام عروض Circle Care و/أو محتوى أعضاء من جهات خارجية بالتزامن مع أي محتوى آخر تابع لجهة خارجية. لا يجوز لك استخدام أي وسيلة آلية أو شكل من أشكال كشط أو استخراج البيانات للوصول إلى محتوى أو معلومات أخرى من Circle Care أو الاستعلام عنها أو جمعها. لا يجوز لك استغلال أي جانب من جوانب عروض Circle Care و/أو محتوى الأعضاء من جهات خارجية لأي أغراض تجارية لا تسمح بها Circle Care صراحة. أنت توافق أيضًا على تعويض شركة Circle Care وعدم الإضرار بها لعدم امتثالك لهذا القسم 14. تحتفظ Circle Care بأي حقوق لم يتم منحها صراحةً في الاتفاقية.' />
                <Paragraph txt='توافق على أن Circle Care، بناءً على تقديرها الخاص، قد تقوم بإنهاء استخدامك لعروض Circle Care وإزالة وتجاهل أي محتوى داخل Circle Care لأي سبب، بما في ذلك، على سبيل المثال لا الحصر، عندما تعتقد Circle Care أنك قد انتهكت أو تصرفت بشكل غير متسق مع حروف أو روح الشروط والأحكام. يمكن أيضًا لـ Circle Care، بتقديرها الخاص وفي أي وقت، إيقاف توفير الموقع لـ Circle Care وعروض circle care أو أي جزء منها، مع أو بدون إشعار. توافق على أن أي إنهاء لوصولك إلى الموقع لـ Circle Care وعروض Circle Care بموجب أي بند من هذه الشروط والأحكام قد يتم دون سابق إشعار، وتقر وتوافق على أن Circle Care قد تقوم بتعطيل أو حذف المحتوى الخاص بك على الفور و/أو منع أي وصول مستقبلي إلى مثل هذه الملفات أو عروض Circle Care. كما توافق بموجبه على أن Circle Care لن تكون مسؤولة تجاهك أو تجاه أي طرف ثالث عن أي إنهاء لوصولك إلى عروض Circle Care. ستستمر الشروط والأحكام في النطاق الذي يتعلق باستخدامك السابق لعروض Circle Care. لن يُعتبر إنهاء وصولك واستخدامك للموقع لـ Circle Care وعروض Circle Care فرصة لك للتخلص من أي التزامات تنشأ أو تتراكم قبل مثل هذا الإنهاء أو للتقليل من أي مسؤولية يمكن أن تكون لديك تجاه Circle Care.' />
                
                <BulletCircle txtStyles={{ fontWeight: 'bold' }} txt={['حقوق الملكية']} />
                <Paragraph txt='جميع محتوى الأطراف الخارجية والمواد الأخرى المنشورة أو المتاحة من خلال عروض Circle Care، بما في ذلك، دون حصر، التصميم والاختيار والترتيب والتنسيق لهذه العروض، مملوكة لـ Circle Care أو مرخصة لها ومحمية بموجب حقوق النشر والعلامات التجارية والملكية الفكرية الأخرى ذات الصلة. باستثناء ما هو منصوص عليه صراحة في الاتفاقية، لا يجوز استنساخ أي جزء من عروض Circle Care و/أو محتوى الأعضاء الطرف الثالث أو إعادة بثه أو بيعه أو تأجيره أو توزيعه أو نشره أو تحميله علناً أو تغييره لإنشاء أعمال جديدة أو تنفيذه أو رقمنته أو ترجمته أو إرساله بأي طريقة إلى أي كمبيوتر آخر أو تطبيق آخر أو وسيلة أخرى، أو لأي غرض تجاري، دون الحصول على موافقة مسبقة كتابية صريحة من Circle Care. باستثناء ما هو منصوص عليه صراحة في الاتفاقية، لا يتم منحك أي حقوق أو ترخيص في البراءات أو حقوق النشر أو أسرار التجارة أو حقوق الشهرة أو العلامات التجارية فيما يتعلق بأي من عروض Circle Care أو محتوى الأعضاء الطرف الثالث أو أي وثيقة أو برنامج أو خدمات أو مواد أخرى تُشاهد عبرها. لا يشكل نشر المعلومات أو المواد من خلال Circle Care، أي عضو، أو أي مزود طرف ثالث تنازلاً عن أي حق في تلك المعلومات والمواد. تحتفظ Circle Care بجميع الحقوق غير المنصوص عليها صراحة في الاتفاقية. اسم "Circle Care" وشعارها علامات تجارية لـ Circle Care. جميع الرسوم البيانية المخصصة والرموز وأسماء الخدمات هي علامات تجارية و/أو حقوق النشر لـ Circle Care. جميع العلامات التجارية الأخرى هي ملك لأصحابها المعنيين. يُمنع بشدة استخدام أي علامات تجارية لـ Circle Care أو علامات خدماتها أو حقوق النشر أو البراءات أو أسرار التجارة أو أسماء النطاقات و/أو حقوق الملكية الأخرى دون موافقة مسبقة خطية صريحة من Circle Care.' />

                <BulletCircle txtStyles={{ fontWeight: 'bold' }} txt={['تجاوز أو تعطيل أي جزء من عروض Circle Care أو البرامج المرتبطة بها']} />
                <Paragraph txt='لا يجوز لك استخدام أي جهاز أو برنامج أو إجراء للتدخل أو محاولة التدخل في التشغيل الصحيح لعروض Circle Care. لا يجوز لك اتخاذ أي إجراء يفرض عبئًا غير معقول أو غير متناسب على البنية التحتية لعروض Circle Care. إذا قمت بتجاوز أو تعطيل أي جزء من عروض Circle Care أو البرامج المرتبطة، بما في ذلك، على سبيل المثال لا الحصر، حظر ملفات تعريف الارتباط أو منع تشغيل أي أنظمة Circle Care أخرى، فأنت تخل بالاتفاقية، وقد تقوم Circle Care بتعليق أو إنهاء استخدامك لعروض Circle Care دون إشعار. إنهاء وصولك إلى عروض Circle Care لن يعفيك من أي مسؤولية جنائية أو مدنية أخرى قد تنتج عن أفعالك.' />

                <BulletCircle txtStyles={{ fontWeight: 'bold' }} txt={['التعويض']} />
                <Paragraph txt='أنت توافق على تعويض وحماية Circle Care، وشركاتها الأم والفرعية، وكل من أعضائها المختلفين وضباطها ومدرائها وموظفيها ووكلائها وشركاء تقديم المحتوى و/أو الشركاء الآخرين عن أي وجميع المطالبات والنفقات والأضرار والدعاوى والتكاليف والمطالبات و/أو الأحكام بأي شكل من الأشكال، التي تقدمها أي جهة ثالثة نتيجة لـ:' />
                <BulletCircle txt={[
                    'استخدامك لأي من عروض Circle Care',
                    'خرقك للاتفاقية',
                    'انتهاكك لأي حقوق لفرد و/أو كيان آخر',
                    'أي نزاع بينك وأي عضو، أو مزود طرف ثالث، أو طرف ثالث آخر؛',
                    'محتوى العضو الخاص بك و',
                    'أي نزاع بينك وبين Facebook®'
                ]} />
                <Paragraph txt='أحكام القسم 17 تعود بالنفع على شركة Circle Care وشركاتها الأم والفرعية و/أو الشركات التابعة لها، ولكل من مسؤوليها ومديريها وأعضائها وموظفيها ووكلائها ومساهميها ومرخصيها ومورديها و/أو محاميها. يكون لكل من هؤلاء الأفراد والكيانات الحق في المطالبة بتنفيذ هذه الأحكام مباشرة ضدك نيابة عنهم.' />

                <BulletCircle txtStyles={{ fontWeight: 'bold' }} txt={['إخلاء مسؤولية عن الضمانات']} />
                <Paragraph txt='تُقدم لك عروض Circle Care ومحتوى الأعضاء و/أو أي منتجات و/أو خدمات أخرى من Circle Care "كما هي" و "كما هي متاحة". يتم إخلاء أي وكل الضمانات، الصريحة و/أو الضمنية، إلى أقصى حد يسمح به القانون المعمول (بما في ذلك، على سبيل المثال لا الحصر، إخلاء أي ضمانات قابلية للتسويق وعدم انتهاك الملكية الفكرية و/أو ملاءمة لغرض معين). على وجه الخصوص، ولكن ليس كقيد على ذلك، لا تقدم Circle Care أي ضمان بأن عروض Circle Care ومحتوى الأعضاء و/أو أي منتجات و/أو خدمات أخرى من Circle Care:' />
                <BulletCircle txt={[
                    'تلبي متطلباتك؛',
                    'ستكون متواصلة أو موجودة في الوقت المناسب أو آمنة أو خالية من الأخطاء أو مصححة؛',
                    'ستكون خالية من الفيروسات أو worms أو trojan horses أو أي مكونات ضارة أخرى أو برامج مدمرة',
                    'سيتم استخدام طرق أمان كافية ضد التدخل في استمتاعك بها أو ضد التعدي',
                    'ستؤدي إلى إحساس معين بالسعادة أو صحة نفسية أفضل أو قدرة على التغلب على الأمراض النفسية أو أي فائدة أو نتيجة ذات صلة؛',
                    'ستكون دقيقةً أو موثوقةً. قد تحتوي عروض Circle Care ومحتوى الأعضاء و/أو أي منتجات و/أو خدمات أخرى من Circle Care على أخطاء أو مشاكل أو قيود أخرى.'
                ]} />
                <Paragraph txt='Circle Care لن تكون مسؤولة عن توفر اتصال الإنترنت الأساسي المرتبط بـ Circle Care. لا يجوز لأي نصيحة أو معلومة، سواء كانت شفهية أو مكتوبة، تحصل عليها من شركة Circle Care أو أي أعضاء أو مزودين تابعين من جهات خارجية أو بأي طريقة أخرى من خلال أو من عروض Circle Care و/أو محتوى الأعضاء، أن تنشئ أي ضمان غير منصوص عليه صراحةً في الاتفاقية.' />
                
                <BulletCircle txtStyles={{ fontWeight: 'bold' }} txt={['تحديد المسؤولية']} />
                <Paragraph txt='أنت تفهم وتوافق صراحة على أن شركة Circle Care لن تكون مسؤولة تجاهك أو أي طرف ثالث عن أي أضرار مباشرة أو غير مباشرة أو عرضية أو خاصة أو تبعية و/أو نموذجية، بما في ذلك، على سبيل المثال لا الحصر، أضرار الألم والمعاناة والإصابة الشخصية أو الوفاة الخطأ وفقدان الدخل وفقدان الزوجية وانقطاع الأعمال أو أضرار فقدان الأرباح أو السمعة أو فقدان البيانات أو أي خسارة غير مادية أخرى إلى أقصى حد يسمح به القانون. كما لن تكون شركة Circle Care مسؤولة تجاهك أو أي طرف ثالث عن:' />
                <BulletCircle txt={[
                    'استخدام أو عدم القدرة على استخدام عروض Circle Care ومحتوى الأعضاء و/أو أي منتجات و/أو خدمات أخرى من Circle Care .',
                    'تكلفة استبدال السلع والخدمات الناتجة عن أي سلع أو بيانات أو معلومات أو محتوى و/أو أي منتجات و/أو خدمات أخرى من Circle Care تم شراؤها أو الحصول عليها من أو من خلال عروض Circle Care و/أو محتوى الأعضاء.',
                    'عدم تحقيق أي سعادة معينة أو صحة نفسية أو أمراض نفسية أو أي فائدة أو نتيجة ذات صلة أخرى.',
                    'أي مسألة أخرى تتعلق بعروض Circle Care ومحتوى الأعضاء و/أو أي منتجات و/أو خدمات أخرى من Circle Care.',
                    ''
                ]} />
                
                <Paragraph txt='ينطبق هذا الحد على جميع أسباب الدعوى مجتمعة، بما في ذلك، على سبيل المثال لا الحصر، انتهاكات قانون الأوراق المالية، والإخلال بالعقد، والإخلال بالضمان، والإهمال، والمسؤولية الصارمة، والإهمال الطبي وغيره من سوء الممارسة، والإقرار الخاطئ، وأي وكل جرائم أخرى. تبرئ أنت بموجب هذه الوثيقة شركة Circle Care من أي وكل الالتزامات والمسؤوليات والمطالبات التي تتجاوز القيود المذكورة هنا. إذا لم يسمح القانون المعمول به بهذا القيد، فلا يجوز رفع أي دعوى، بغض النظر عن الشكل، ناشئة عن استخدامك لعروض Circle Care ومحتوى الأعضاء و/أو أي منتجات و/أو خدمات أخرى من Circle Care لأكثر من عام واحد (1) بعد الحدث الذي أدى إلى سبب الدعوى. إن إنكار التعويضات المنصوص عليه أعلاه هو عنصر أساسي لأساس الصفقة بينك وبين شركة Circle Care. لن يتم توفير الوصول إلى عروض Circle Care ومحتوى الأعضاء و/أو أي منتجات و/أو خدمات أخرى من Circle Care لك بدون هذه القيود. لا تسمح بعض الولايات القضائية بفرض قيود معينة على المسؤولية، وفي مثل هذه الولايات القضائية، تقتصر مسؤولية شركة Circle Care على الحد الأقصى الذي يسمح به القانون.ينطبق هذا الحد على جميع أسباب الدعوى مجتمعة، بما في ذلك، على سبيل المثال لا الحصر، انتهاكات قانون الأوراق المالية، والإخلال بالعقد، والإخلال بالضمان، والإهمال، والمسؤولية الصارمة، والإهمال الطبي وغيره من سوء الممارسة، والإقرار الخاطئ، وأي وكل جرائم أخرى. تبرئ أنت بموجب هذه الوثيقة شركة Circle Care من أي وكل الالتزامات والمسؤوليات والمطالبات التي تتجاوز القيود المذكورة هنا. إذا لم يسمح القانون المعمول به بهذا القيد، فلا يجوز رفع أي دعوى، بغض النظر عن الشكل، ناشئة عن استخدامك لعروض Circle Care ومحتوى الأعضاء و/أو أي منتجات و/أو خدمات أخرى من Circle Care لأكثر من عام واحد (1) بعد الحدث الذي أدى إلى سبب الدعوى. إن إنكار التعويضات المنصوص عليه أعلاه هو عنصر أساسي لأساس الصفقة بينك وبين شركة Circle Care. لن يتم توفير الوصول إلى عروض Circle Care ومحتوى الأعضاء و/أو أي منتجات و/أو خدمات أخرى من Circle Care لك بدون هذه القيود. لا تسمح بعض الولايات القضائية بفرض قيود معينة على المسؤولية، وفي مثل هذه الولايات القضائية، تقتصر مسؤولية شركة Circle Care على الحد الأقصى الذي يسمح به القانون.' />

                <BulletCircle txtStyles={{ fontWeight: 'bold' }} txt={['مواقع الويب من جهات خارجية']} />
                <Paragraph txt='تحتوي عروض Circle Care على روابط لمواقع ويب أخرى على الإنترنت يملكها ويشغلها أطراف ثالثة، بما في ذلك مزودو الطرف الثالث. في بعض الحالات، قد تكون هذه المواقع الإلكترونية مواقع تعاون على الإنترنت يملكها ويشغلها أطراف ثالثة، بما في ذلك مزودو الطرف الثالث. في بعض الحالات، قد تكون هذه المواقع مشتركة العلامة التجارية، ويحق لأطراف ثالثة استخدام اسم وشعار Circle Care على مواقع الويب الخاصة بهم. لا تتحكم Circle Care في المعلومات أو المنتجات أو الخدمات المتوفرة على مواقع الويب الخاصة بالجهات الخارجية هذه. إدراج العلامة التجارية المشتركة و/أو الروابط لا يعني تأييد Circle Care لموقع الويب المعني أو أي ارتباط مع مشغلي الموقع. نظرًا لأن Circle Care لا تملك سيطرة على هذه المواقع والموارد، فإنك توافق على أن Circle Care ليست مسؤولة عن توفر أو تشغيل مواقع الويب الخارجية هذه، أو عن أي مواد موجودة على أو متوفرة من أي من مواقع الويب هذه، أو عن حماية خصوصية بياناتك من قبل جهات خارجية. تُعد أي تعاملات أو مشاركة في العروض الترويجية التي يقدمها المعلنون أو الموردون من جهات خارجية المعروضون على Circle Care، بما في ذلك دفع وتسليم السلع أو الخدمات ذات الصلة، وأي شروط وأحكام وضمانات أو إقرارات أخرى مرتبطة بهذه التعاملات أو العروض الترويجية، مسؤولية مشتركة بينك وبين مزود الطرف الثالث المعلن أو أي طرف ثالث آخر، حسب الاقتضاء. أنت توافق أيضًا على أن Circle Care لن تكون مسؤولة، بشكل مباشر أو غير مباشر، عن أي خسارة أو ضرر ناتج عن استخدام أو الاعتماد على أي مواد متاحة على أو من خلال أي من هذه المواقع أو أي من هذه التعاملات أو العروض الترويجية.' />

                <BulletCircle txtStyles={{ fontWeight: 'bold' }} txt={['معلومات العضو']} />
                <Paragraph txt='ما لم نقدم خلاف ذلك صراحة في الاتفاقية واخضاعًا لسياسة الخصوصية، فإن جميع التعليقات والمحتوى والمعلومات و/أو المواد التي تقدمها من خلال هذا التطبيق و/أو العروض التي تقدمها Circle Care، بما في ذلك، دون حصر، محتوى الأعضاء، يخضع لسياسة الخصوصية. للحصول على نسخة من سياسة الخصوصية، يرجى النقر هنا. من خلال تقديم هذا المحتوى و/أو المواد لنا، فإنك تخضع لسياسة الخصوصية:' />
                <BulletCircle txt={[
                    'تمثيل وضمان أن استخدام Circle Care لتقديمك لا ينتهك أي اتفاقية، أو ينتهك أي قانون، أو ينتهك حقوق أي طرف ثالث وأنه صحيح ودقيق في جميع النواحي.',
                    'الموافقة على أن Circle Care مجانًا لاستخدام كل أو جزء من هذا المحتوى و/أو المواد بأي طريقة يراها مناسبة دون التزام بإعلامك أو تحديد هويتك أو تعويضك أو أي شخص آخر؛ و',
                    'منح Circle Care جميع الحقوق اللازمة، بما في ذلك تنازلًا عن جميع حقوق الطبع والنشر والعلامات التجارية وعلامات الخدمة والخصوصية وحق النشر والحقوق الأخلاقية، لاستخدام جميع محتوى الأعضاء و/أو المواد، كليًا أو جزئيًا، أو كعمل مشتق، دون أي واجب من Circle Care تجاه أي شخص على الإطلاق.'
                ]} />

                <Paragraph customStyles={{marginTop: 10, marginBottom: 4, fontWeight: 'bold'}} txt='سياسة حقوق النشر / الامتثال لقانون (DMCA)' />
                <Paragraph txt='تحفظ شركة Circle Care الحق في إنهاء عضوية أي عضو ينتهك حقوق الطبع والنشر الخاصة بجهات خارجية بشكل متكرر. إذا كنت تعتقد أن العمل المحمي بحقوق النشر قد تم نسخه و/أو نشره على أو من خلال Circle Care و/أو الخدمات بطريقة تشكل انتهاكًا لحقوق النشر، يجب عليك تزويد Circle Care بالمعلومات التالية:' />
                <BulletCircle txt={[
                    'توقيع إلكتروني أو مادي للشخص المخول بالتصرف نيابة عن مالك العمل المحمي بحقوق النشر ',
                    'تعريف وموقع العمل المحمي بحقوق النشر على Circle Care (أو غير ذلك) الذي تزعم أنه تم التعدي عليه',
                    'إقرار خطي منك بأن لديك اعتقادًا حسن النية بأن الاستخدام المتنازع فيه غير مصرح به من قبل المالك أو وكيله أو القانون',
                    'اسمك ومعلومات الاتصال بك، مثل رقم الهاتف أو عنوان البريد الإلكتروني',
                    'إقرار منك بأن المعلومات الواردة أعلاه في إخطارك دقيقة وتحت طائلة الحنث باليمين أنك أنت مالك حقوق النشر أو مخول بالتصرف نيابة عن مالك حقوق النشر'
                ]} />
            </View>
        </ScrollView>
    )
}

export default ArabicContent

const styles = StyleSheet.create({
    contentContainer: {
        paddingTop: 20,
        // gap: 20
    },
    // typography
    heading: {
        fontSize: textScale(15),
        color: "#576B74",
        fontWeight: 'bold',
        marginBottom: 16,
        textAlign: 'left'
    },
    paragraph: {
        textAlign: 'left',
        fontSize: textScale(15),
        color: "#576B74",
        marginBottom: 16,
    },
    bullet: {
        textAlign: 'left',
        fontSize: textScale(15),
        color: "#576B74",
        marginBottom: 8,
    },
    bulletCrcle: {
        width: 6,
        height: 6,
        borderRadius: scale(50),
        backgroundColor: '#576B74',
        marginTop: textScale(5)
    },
    flexRow: {
        flexDirection: 'row',
        alignItems: 'flex-start',
        
    },
})